{
    "app_name": "discution helper",
    "Objectif de l'app": "aider les utilisateur en leur proposant des idee pour poursuivre une discution en ce basant sur les conversation anterieur",
    "cause": "Souvant on a du mal a tenir une conversation sur les resaux sociau et mesagerie instantaner. on ne sait pas quoi dire a l'autre",
    "affichage": "un bubble flotant deplacable a volonter qui s'affiche au decu de toute les autre app comme un bubble de notif facebook",
    "comportement du bubble": {
        "un appuit long": "afficher une serie d'option",
        "un appuit simple": "ouvrir une activiter flotant(mainActiviy) qui occupe seulement la moitier de l'ecran.Du milieur vers le bas"
    },
    "mainActiviy": {
        "menu 1":{
            "items":{
                "Activer le SA": {
                    "fonction": "renvois ver les service d'accessibiliter dans les parametre pour les activer pour l'app"
                },
                "Status du SA":{
                    "fonction": "Affiche si les service d'accessibiliter sont deja activer ou pas pour l'app"
                },
                "App list": {
                    "fonction 1": "Affiche une todo liste des app installer sur le telephone avec leur icone",
                    "fonction 2": "un bouton (appliquer) permet de rendre les app selectionner. ce sont ces app qui contienne les discution a recuperer"
                },
                "eclairage":{
                    "fonction": "permet de choisire le mode sombre ou lumineux"
                }
            }
        },
        "menu 2":{
            "items":{
                "A-Z": {
                    "fonction": "scrol l'ecrant jusquant haut completement(debut) de la discution, puis commence a recuperer les conversation un a un en scrolant automatiquement vers le bas jusqu'a la fin de la discution"
                },
                "A-X": {
                    "fonction": "comment a recuperer et scroller de l'amplacement acuel de l'ecrant vers le haut au debut de la discution"
                },
                "X-Z": {
                    "fonction": "contraire de A-X"
                }
            }
        },

        "mainActiviy body": {
            "content":{
                "scrolLayout":{
                    "horientation": "horizontal",
                    "content": "des layout contenant les propostion avec une option pour copier un peux comme les conversation chatGPT"
                }
            }
        }

    }
    
}